{"calories":{"10067":95.0,"1027":18.0,"10306":87.0,"10314":59.0,"1041":136.0},"categories":{"10067":["Cookies","Milk\/Cream","Chocolate","Dessert","Bake","Kid-Friendly","Orange","Chill","Gourmet","Kidney Friendly","Vegetarian","Pescatarian","Peanut Free","Tree Nut Free","Soy Free","Kosher"],"1027":["Cookies","Food Processor","Mixer","Nut","Bake","Christmas","Almond","Gourmet"],"10306":["Cookies","Dorie Greenspan","Chocolate","Christmas","Edible Gift","Coffee","Bake"],"10314":["Cookies","Fruit","Dessert","Bake","Christmas","Date","Walnut","Winter","Gourmet","Kidney Friendly","Vegetarian","Pescatarian","Peanut Free","Soy Free","Kosher"],"1041":["Cookies","Dessert","Bake","Christmas","Edible Gift","Christmas Eve","Butter","Gourmet","Kidney Friendly","Vegetarian","Pescatarian","Peanut Free","Tree Nut Free","Soy Free","Kosher"]},"date":{"10067":1092974400000,"1027":1092974400000,"10306":1478283895340,"10314":1092974400000,"1041":1357185600000},"desc":{"10067":"Active time: 30 min Start to finish: 1 3\/4 hr","1027":"This dough can also be formed into crescent shapes and coated with confectioners' sugar while still warm, as is done in many eastern European countries.","10306":"My original recipe for these deeply coffee-flavored and amply chocolate-flecked cookies produced a classic shortbread with the melt-in-your-mouth texture that’s the hallmark of great shortbread and the result of using only confectioners’ sugar in the dough. When I adapted the recipe for Beurre & Sel and baked the cookies in metal rings, constraining their spreadability, the change was anything but subtle: The sablés were still tender, but their texture became denser and their flavor more intense.","10314":"Active time: 30 min Start to finish: 3 hr","1041":"Just reading the words \"salted brown butter\" is enough to tickle your taste buds. But making salted brown butter the flavor base of a cookie will turn your holiday cookie swap into the hottest, hippest party in town. Thankfully, the dough is a dream to roll out, and it's strong enough to keep the shape of the cookie-cutters you use, no matter how intricate. Want to hang them on the tree? Just cut a little hole before baking with the narrow end of a pastry bag tip. Keep this recipe handy for when you've got a houseful of kids on a school break and need a project to get them off their cell phones!"},"directions":{"10067":["Whisk together flour, brown sugar, cocoa powder, and salt in a bowl.","Melt chocolate and butter in a metal bowl set over a saucepan of barely simmering water, stirring occasionally, until smooth. Remove bowl from heat and stir in eggs, zest, and flour mixture until just combined. (Dough will be soft.)","Roll out dough between parchment sheets into an 8-inch round (1\/2 inch thick). Transfer round (still in parchment) to a large baking sheet and chill until firm, at least 1 hour, or freeze at least 30 minutes.","Preheat oven to 350°F.","Remove top sheet of parchment paper and replace it loosely. Flip over paper-enclosed round and discard paper now on top. Cut out about 20 cookies with cookie cutter and arrange about 1 inch apart on a buttered large baking sheet. Reroll scraps between parchment sheets and cut out 12 more cookies (chill or freeze dough as needed if it becomes too soft to handle).","Bake cookies in middle of oven until matte (dough will start out shiny and turn dull), about 10 minutes, then transfer with a spatula to a rack to cool completely. (Cookies will have a fudgy consistency.)","Beat cream and sugar with an electric mixer until it just holds stiff peaks. Top each cookie with 1\/2 teaspoon cream and a piece of orange."],"1027":["Halve 1 cup almonds and reserve.","In a food processor grind almonds with sugar and salt until fine. In bowl of a standing electric mixer beat almond mixture and almond extract into basic dough until just combined well. Pat dough into a rectangle. Chill dough, wrapped in wax paper, at least 1 hour or overnight.","Preheat oven to 350°F.","Working with one third of dough at a time, roll out each piece of dough between two sheet of wax paper into a 12- by 9-inch rectangle, slightly more than 1\/8-inch thick. Cut dough into 1 1\/2- to 2-inch almond shapes (or any other shape preferred), arranging cookies about 1\/2 inch apart of baking sheets. If dough becomes too soft to work with, freeze or chill uncut dough on baking sheet until firm.","Brush cookies lightly with egg whites and gently press a reserved almond half in center of each cookie.","Bake cookies in batches in middle of oven until pale golden, about 10 minutes, and cool on racks. Cookies may be stored between layers of wax paper in airtight containers up to 6 weeks frozen."],"10306":["Dissolve the espresso in the boiling water. Set the extract aside to cool to lukewarm or room temperature.","Working with a stand mixer fitted with the paddle attachment, or in a large bowl with a hand mixer, beat the butter, sugar, salt and cinnamon, if you’re using it, together on medium speed for about 3 minutes, scraping down the bowl as needed, until well blended.","Mix in the vanilla and espresso extract on low speed. Turn off the mixer, add the flour all at once and pulse to begin incorporating it, then mix on low speed until the flour almost disappears into the dough. Scrape down the bowl, add the chopped chocolate and mix until evenly distributed. Give the dough a few last turns with a sturdy flexible spatula.","Turn the dough out onto the counter and divide it in half. Shape each half into a disk.\nWorking with one piece of dough at a time, sandwich it between pieces of parchment paper and roll it to a thickness of 1\/4 inch. Slide the dough, still sandwiched, onto a baking sheet—you can stack the slabs—and freeze the dough for at least 1 hour, or refrigerate for at least 2 hours.","Center a rack in the oven and preheat it to 325ºF. Butter or spray a regular muffin tin, or two tins, if you’ve got them. Have a 2-inch-diameter cookie cutter at hand.","Working with one sheet of dough at a time, peel away both pieces of paper and put the dough back on one piece of paper. Cut the dough and drop the rounds into the muffin tin(s).","The dough might not fill the molds completely, but it will once baked. Save the scraps from both pieces of dough, then gather them together, re-roll, chill and cut.","Bake the cookies for 18 to 20 minutes, or until they feel firm to the touch and have some color. Transfer the muffin tin(s) to a rack and leave the cookies in the tin(s) for about 10 minutes before carefully lifting them out onto the rack to cool completely.","Continue with the remainder of the dough, if you only baked one sheet, always using cool tins.","For Ringed Espresso-Chocolate Sablés: If you have 2-inch baking rings, use them to cut out the rolled dough. Bake the dough—in the rings—on lined baking sheets just as you would the muffin-tin cookies. Leave the rings in place for at least 20 minutes before lifting them off, rinsing and reusing."],"10314":["Preheat oven to 350°F.","Grease a 13- by 9- by 2-inch metal baking pan, then line with foil, leaving a 2-inch overhang on 2 opposite sides, and butter foil.","Whisk together flour, salt, and spices. Beat together butter and granulated sugar in a bowl with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes in a standing mixer (preferably fitted with paddle attachment) or 6 minutes with a handheld. Reduce speed to low and add eggs 1 at a time, mixing well after each addition. Add baking soda mixture and mix until combined. Add flour mixture, walnuts, and dates and mix until just combined.","Spread batter evenly in baking pan and bake in middle of oven until a tester comes out clean, 50 minutes to 1 hour. Cool in pan on a rack 15 minutes. Carefully lift date mixture out of pan using foil overhang and transfer to a cutting board. Cut into 1-inch squares and peel from foil.","Toss warm squares a few at a time in confectioners sugar, then transfer to a rack to cool completely. Sprinkle with more confectioners sugar just before serving."],"1041":["Melt butter in a 1- to 2-quart heavy saucepan over medium-low heat, then cook over low heat, swirling pan occasionally, until butter has a nutty aroma and is a rich brown color, and bottom of pan is speckled with browned bits of the milk solids, 8 to 10 minutes. Transfer to a bowl, including browned milk solids on bottom, and chill until almost firm, about 30 minutes.","Whisk together flour and cornstarch in a bowl. Beat together butter and sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, then beat in egg, salt, and vanilla. Add flour mixture and mix on low speed until just combined well.","Form dough into 2 balls and flatten each into a 6-inch disk. Chill disks, wrapped in plastic wrap, until firmer, but not hard, 15 to 30 minutes.","Heat oven to 350°F with rack in middle position. Line a large baking sheet with parchment paper.","Roll out 1 disk of dough (keep remaining dough chilled) between 2 large sheets of wax paper 1\/8 inch thick (this is when the rolling pin rings are really helpful). Freeze or chill dough on a baking sheet or tray until firm, 5 to 15 minutes, then cut out as many cookies as possible from dough. Transfer cookies to lined baking sheet, arranging cookies about 1 inch apart. If the cookies become too warm to transfer, freeze or chill until firm (see Cooks' notes).","Bake cookies, 1 sheet at a time, until edges are golden, 8 to 10 minutes, then transfer to racks to cool completely.","Meanwhile, gather scraps of dough and repeat cookie process above. Parchment can be reused, but make sure baking sheet cools between batches. Make more cookies with remaining dough.","Beat together all ingredients in a large bowl with an electric mixer at medium speed until just combined, about 1 minute.","Increase speed to high and continue to beat until icing holds stiff peaks, about 3 minutes in a stand mixer or 10 minutes with a handheld. If not using icing immediately, cover surface with a dampened paper towel, then cover bowl with plastic wrap.","Transfer icing to a heavy-duty resealable bag and press out excess air. Snip a 1\/8-inch opening in bottom corner of bag, then twist bag firmly just above icing and decoratively pipe icing onto cookies. If desired, sprinkle with sanding sugars or colorful sea salts while icing is still wet. (For tinted icing, see Cooks' notes.)","Let icing dry completely (about 1 hour) before storing cookies."]},"fat":{"10067":4.0,"1027":1.0,"10306":6.0,"10314":2.0,"1041":4.0},"ingredients":{"10067":["1 cup all-purpose flour","2\/3 cup packed dark brown sugar","2 tablespoons unsweetened cocoa powder","1\/2 teaspoon salt","7 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped","1\/2 stick (1\/4 cup) unsalted butter, cut into pieces","2 large eggs","2 teaspoons finely grated fresh orange zest","1\/2 cup chilled heavy cream","1 teaspoon sugar","4 navel orange segments, membranes discarded from each and fruit cut into 1\/4-inch pieces","Special equipment: 2 (12-inch-long) sheets of parchment paper; a 1 1\/2-inch round fluted cookie cutter"],"1027":["2 2\/3 cups blanched almonds (about 3\/4 pound)","1\/2 cup sugar","1\/4 teaspoon salt","1 1\/2 teaspoons almond extract","1\/2 prepared Basic Butter Cookie Dough at room temperature","2 egg whites, beaten lightly"],"10306":["1 1\/2 tablespoons instant espresso","1 tablespoon boiling water","2 sticks (8 ounces; 226 grams) unsalted butter, cut into chunks, at room temperature","2\/3 cup (80 grams) confectioners’ sugar","1\/2 teaspoon fine sea salt","Pinch ground cinnamon (optional)","3\/4 teaspoon pure vanilla extract","2 cups (272 grams) all-purpose flour","4 ounces (113 grams) bittersweet chocolate, finely chopped"],"10314":["2 cups all-purpose flour","1\/2 teaspoon salt","1\/2 teaspoon cinnamon","1\/4 teaspoon freshly grated nutmeg","1\/4 teaspoon ground cloves","2 sticks (1 cup) unsalted butter, softened","1 1\/2 cups granulated sugar","2 large eggs","1 teaspoon baking soda dissolved in 1\/4 cup hot water","1 cup walnuts (4 oz), finely chopped","1 lb dried pitted dates, finely chopped with an oiled knife (2 cups)","2 cups confectioners sugar"],"1041":["1 1\/2 sticks (3\/4 cup) unsalted butter, cut into pieces","2 cups all-purpose flour","1\/4 cup cornstarch","3\/4 cup packed light brown sugar","1 large egg","3\/4 teaspoon fine sea salt","1 teaspoon vanilla","1 (1-pound) box confectioners' sugar","4 teaspoons powdered egg whites (not reconstituted), such as Just Whites, or meringue powder (see Cooks' notes)","1\/3 cup water","1 teaspoon fresh lemon juice","1 teaspoon vanilla","Decorative sugars and or salts, if desired","Special equipment: Wax paper and parchment paper; rolling pin rings (optional, but really helpful; see Cooks' notes:); 3- to 4-inch holiday cookie cutters; several small, heavy-duty sealable plastic bags (not pleated), if icing cookies"]},"protein":{"10067":1.0,"1027":1.0,"10306":1.0,"10314":1.0,"1041":1.0},"rating":{"10067":3.75,"1027":4.375,"10306":0.0,"10314":4.375,"1041":5.0},"sodium":{"10067":46.0,"1027":5.0,"10306":30.0,"10314":23.0,"1041":55.0},"title":{"10067":"Chocolate Orange Petits Fours ","1027":"Almond Butter Crisps ","10306":"Espresso Chocolate Sablés ","10314":"Date Squares ","1041":"Salted Brown Butter Cookies "}}